app/controllers/loanapps_controller.rb

  def show
    @loanapp = Loanapp.find(params[:id])
---
SELECT * FROM "loanapps" WHERE ("loanapps"."id" = 0)