app/controllers/memberapps_controller.rb

SELECT * FROM "memberapps" WHERE ("memberapps"."id" = 0)
---
  def show
    @memberapp = Memberapp.find(params[:id])

INSERT INTO "memberapps" ("name", "address", "city", "work_phone", "overdraft_protection", "typeof_protection", "zip", "member_eligibility", "atm_card", "audio_response", "created_at", "joint_name", "ssn", "updated_at", "salutation", "account", "home_phone", "birth_date", "hire_date", "mmdebit_card", "badge_no", "time2call", "email_address", "citizen", "state") VALUES('ssererwer', '324 ahem lane', 'sodakanadi', '', 'yes', 'No Overdraft Privilege Requested', 13545, 'Family', 'yes', NULL, '2010-09-20 17:57:53', '', '12-34-23821', '2010-09-20 17:57:53', 'Mrs.', 'prime', '145-354-5454', '12-23-1978', '', 'no', '', '', 'djhsgjh@dnjkdf.com', NULL, 'ND')
---
  def create
    @memberapp = Memberapp.new(params[:memberapp])

    respond_to do |format|
      if @memberapp.save