app/controllers/rfis_controller.rb

SELECT * FROM "rfis" WHERE ("rfis"."id" = 0)
---
  def show
    @rfi = Rfi.find(params[:id])

INSERT INTO "rfis" ("individual_retirement", "name", "address", "city", "christmas_clubac", "audio_response", "other_questions", "zip", "created_at", "irashare_certificates", "heloc", "mortgage_loan", "updated_at", "overdraft_loan", "personal_loan", "master_moneydc", "payroll_deduction", "notary_service", "savings_account", "share_certificates", "mac_atmcard", "money_orders", "money_marketac", "phone", "family_membership", "direct_deposit", "membership_application", "sharedraft_ac", "visa_creditcard", "entertainment_tickets", "other_info", "automobile_loan", "travelers_check", "email", "state") VALUES(NULL, 'sdfhgsdghsdgh', 'dghdghgh', 'dsghsdghdgh', NULL, NULL, 'hshdghdgh', 0, '2010-09-17 18:54:55', NULL, NULL, NULL, '2010-09-17 18:54:55', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'gdhssdghdgh', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'sdghsdgh', 'MI')
---
  def create
    @rfi = Rfi.new(params[:rfi])

    respond_to do |format|
      if @rfi.save